run/discFallingIntoWater/baseCase/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          dynamicMeshDict;
}

dynamicFvMesh       dynamicFloaterMotionSolversFvMesh;

addedMassModel      pisoAddedMass;

solvers
{
    circle
    {

        motionSolverLibs ( floaterMotion );

        motionSolver    floaterMotion;

        floaterMotionCoeffs
        {
            patches         ( floatingObject );
            innerDistance   1;
            outerDistance   9.5;
            #include "floaterMassAndInertia"
            linDirs         ( 0 1 0 );
            rotDirs         ( 0 0 0 );
            MaddUpdateFreq  1;

            restraints
            {
            }
        }
    }
}

// ************************************************************************* //
