run/discFallingIntoWater/baseCase/system/meshParms
R1    1.000000000000;
R2    10.000000000000;
R1OverSqrt2    0.707106781187;
R2OverSqrt2    7.071067811865;
z1    -0.500000000000;
z2    0.500000000000;
nx    50;
ny    50;
nz    1;
z1PlusEps    -0.499000000000;
z1MinusEps    -0.501000000000;
z2PlusEps    0.501000000000;
z2MinusEps    0.499000000000;
R1PlusEps    1.001000000000;
mR1PlusEps    -1.001000000000;
grading    10.000000000000;
